{"config": [{"config": {"embeddings_constraint": null, "dtype": "float32", "batch_input_shape": [null, 500], "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "embeddings_regularizer": null, "output_dim": 32, "trainable": true, "activity_regularizer": null, "input_dim": 129, "input_length": 500, "name": "embedding_1"}, "class_name": "Embedding"}, {"config": {"recurrent_regularizer": null, "unit_forget_bias": true, "bias_regularizer": null, "return_sequences": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "go_backwards": false, "return_state": false, "bias_constraint": null, "kernel_regularizer": null, "name": "lstm_1", "units": 200, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "use_bias": true, "dropout": 0.0, "recurrent_constraint": null, "unroll": false, "trainable": true, "activity_regularizer": null, "implementation": 1, "stateful": false, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"use_bias": true, "bias_regularizer": null, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_1", "units": 1}, "class_name": "Dense"}], "keras_version": "2.1.5", "class_name": "Sequential", "backend": "tensorflow"}